In [1]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn import linear_model
from word2number import w2n
import math

In [2]:
#Reding the dataset

d = pd.read_csv("hiring.csv")

In [3]:
#Checking the nan value in the datasetd.isnull().sum()

In [4]:
#Fill the nan with "ZERO"
d.experience=d.experience.fillna("zero")

In [5]:
#Checking the "d" as we filled with ZERO of all the nan value
d

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
#Converting word to nuber in the column experience
d.experience = d.experience.apply(w2n.word_to_num)

In [7]:
d

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [8]:
test_score_median=math.floor(d['test_score(out of 10)'].mean())

In [9]:
#Fill the na value in 'test_score(out of 10)' by applying taking the mean value
d['test_score(out of 10)'] = d['test_score(out of 10)'].fillna(test_score_median)
d

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [10]:
#Checking the null value in the dataset
d.isnull().sum()
#There should not be any null value

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [11]:
#Calling Linear Regression model& fit it
reg = linear_model.LinearRegression()
reg.fit(d[['experience','test_score(out of 10)','interview_score(out of 10)']],d['salary($)'])

LinearRegression()

In [12]:
#Expreience=5,test score=7,intreview score=6
reg.predict([[5,7,6]])

C:\Users\arabi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\sklearn\base.py:441: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([58038.05561713])